app/controllers/needs_controller.rb

INSERT INTO `needs` (`title`, `description`, `user_id`) VALUES('A title', 'A description', NULL)
---
  def create
    @need = Need.new(params[:need])
    @need.user = current_user
    if @need.save

SELECT * FROM `needs` WHERE (`needs`.`id` = 10)
---
  def show
    @need = Need.find(params[:id])