app/controllers/tags_controller.rb

  def show
    @tag = Tag.find(params[:id])
---
SELECT * FROM `tags` WHERE (`tags`.`id` = 10)